# Задача №4: Показать первую цифру дробной части числа.

n = float(input())
print(int(n*10) % 10)
